#include <iostream>      
#include <cmath>       
#include <iomanip>       // для setw() (ширина поля) 
using namespace std;

double f(double x) {
    return 5 * sin(x) - x; //функция: f(x) = 5*sin(x) - x
}
double f1(double x) {
    return 5 * cos(x) - 1; // Производная: f'(x) = 5*cos(x) - х
}

double phi(double x) { // Функция для метода простых итераций: x = 5*sin(x)
    return 5 * sin(x);
}

void bisection(double a, double b, double eps) { // метод половинного деления(ДИХОТОМИЯ) 
    cout << "\n=== Метод половинного деления ===\n";
    cout << "+---+-----------+-----------+-----------+\n";
    cout << "| N | a_n       | b_n       | diff      |\n";
    cout << "+---+-----------+-----------+-----------+\n";
    int n = 1;               // номер итерации
    double c;                // середина отрезка
    
    while ((b - a) / 2 > eps) {     // Пока длина отрезка больше точности
        c = (a + b) / 2;     // находим середину
        cout << "| " << setw(2) << n << " | "
             << fixed << setprecision(6) << setw(10) << a << " | "
             << setw(10) << b << " | " << setw(10) << b - a << " |\n";
        if (f(a) * f(c) < 0)
            b = c;           // сдвигаем правую границу
        else
            a = c;           // иначе сдвигаем левую границу
        
        n++;                 // увеличиваем счётчик
    }
    
    cout << "+---+-----------+-----------+-----------+\n";
    cout << "Корень: " << (a + b) / 2 << "\n";
}

void newton(double x0, double eps) {   //метод ньютона (касательных)
    cout << "\n=== Метод Ньютона ===\n";
    cout << "+---+-----------+-----------+-----------+\n";
    cout << "| N | x_n       | x_n+1     | diff      |\n";
    cout << "+---+-----------+-----------+-----------+\n";
    double x = x0;           // текущее приближение
    double xn;               // следующее приближение
    int n = 1;               // номер итерации
    
    do {
        xn = x - f(x) / f1(x);   // формула Ньютона
        cout << "| " << setw(2) << n << " | "
             << setw(10) << x << " | " << setw(10) << xn << " | "
             << setw(10) << fabs(xn - x) << " |\n";
        n++;                 // увеличиваем счётчик
        x = xn;              // переходим к следующему приближению
        
    } while (fabs(f(xn)) > eps && n < 100);   // пока значение функции не станет малым
    cout << "Корень: " << xn << "\n";
}

void iteration(double x0, double eps) { //метод простых итерации
    cout << "\n=== Метод простых итераций ===\n";
    cout << "+---+-----------+-----------+-----------+\n";
    cout << "| N | x_n       | x_n+1     | diff      |\n";
    cout << "+---+-----------+-----------+-----------+\n";
    double x = x0;           // текущее приближение
    double xn;               // следующее приближение
    int n = 1;               // номер итерации
    
    do {
        xn = phi(x);         // подставляем в преобразованную функцию
        cout << "| " << setw(2) << n << " | "
             << setw(10) << x << " | " << setw(10) << xn << " | "
             << setw(10) << fabs(xn - x) << " |\n";
        
        n++;                 // увеличиваем счётчик
        x = xn;              // переходим к следующему приближению
        
    } while (fabs(xn - x) > eps && n < 100);   // пока разница больше точности
    
    cout << "Корень: " << xn << "\n";
}

int main() {
    double a, b;      // границы интервала для метода дихотомии
    double x0;        // начальное приближение
    double eps;       // точность
    
    // Вводим данные
    cin >> a >> b >> x0 >> eps;
  
    // Запускаем все три метода
    bisection(a, b, eps);   // метод половинного деления
    newton(x0, eps);        // метод Ньютона
    iteration(x0, eps);     // метод простых итераций
    return 0;   
}